#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challenge-336404/cloudresourcemanager.googleapis.com]
module.analytics-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-analytics]
google_pubsub_topic.ldn_arrive_topic: Refreshing state... [id=projects/de-challenge-336404/topics/metascore-lnd-notification]
module.raw-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-raw]
module.landing-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-lnd]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
google_pubsub_topic_iam_binding.ldn_arrive_binding: Refreshing state... [id=projects/de-challenge-336404/topics/metascore-lnd-notification/roles/pubsub.publisher]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
google_storage_notification.object_landing_notification: Refreshing state... [id=de-challenge-336404-metascore-lnd/notificationConfigs/5]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iam.googleapis.com]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challenge-336404/storage-component.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iamcredentials.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challenge-336404/bigquery.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challenge-336404/dataflow.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challenge-336404/appengine.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challenge-336404/container.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudfunctions.googleapis.com]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challenge-336404/datastudio.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challenge-336404/compute.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudbuild.googleapis.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_pubsub_topic.ldn_arrive_topic has changed
  ~ resource "google_pubsub_topic" "ldn_arrive_topic" {
        id      = "projects/de-challenge-336404/topics/metascore-lnd-notification"
      + labels  = {}
        name    = "metascore-lnd-notification"
        # (1 unchanged attribute hidden)
    }

  # google_storage_notification.object_landing_notification has changed
  ~ resource "google_storage_notification" "object_landing_notification" {
      + custom_attributes = {}
        id                = "de-challenge-336404-metascore-lnd/notificationConfigs/5"
        # (6 unchanged attributes hidden)
    }

  # module.analytics-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challenge-336404-metascore-analytics"
      + labels                      = {}
        name                        = "de-challenge-336404-metascore-analytics"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAI=" -> "CAU="
        id     = "b/de-challenge-336404-metascore-analytics/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challenge-336404-metascore-lnd"
      + labels                      = {}
        name                        = "de-challenge-336404-metascore-lnd"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAI=" -> "CAY="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl"
        # (3 unchanged attributes hidden)
    }

  # module.raw-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challenge-336404-metascore-raw"
      + labels                      = {}
        name                        = "de-challenge-336404-metascore-raw"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAM=" -> "CAU="
        id     = "b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.analytics_dataset["consumption"].google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "consumption"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + project                    = "de-challenge-336404"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.analytics_dataset["staging"].google_bigquery_dataset.main will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "staging"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + project                    = "de-challenge-336404"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.analytics_dataset_data_owner["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahidale.zg@gmail.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataOwner"
    }

  # module.analytics_dataset_data_owner["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahidale.zg@gmail.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataOwner"
    }

  # module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Gustavo.Aguilar0@walmart.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Mariano.Gonzalez0@walmart.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "consumption"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahid.galea@wom.cl"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Gustavo.Aguilar0@walmart.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:Mariano.Gonzalez0@walmart.com"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

  # module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"] will be created
  + resource "google_bigquery_dataset_iam_member" "dataset_iam" {
      + dataset_id = "staging"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "user:zahid.galea@wom.cl"
      + project    = "de-challenge-336404"
      + role       = "roles/bigquery.dataViewer"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge`, Workflow: `Terraform Planning`*